## Plan for scan_queue
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.scan_runner_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_runner_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:806545929748:function:api",
            ]
        }
      + statement {
          + actions   = [
              + "states:CreateActivity",
              + "states:DescribeExecution",
              + "states:ListActivities",
              + "states:ListStateMachines",
              + "states:StopExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:806545929748:*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetRecords",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "states:CreateActivity",
              + "states:DescribeExecution",
              + "states:ListActivities",
              + "states:ListStateMachines",
              + "states:StopExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:806545929748:*",
            ]
        }
      + statement {
          + actions   = [
              + "events:DescribeRule",
              + "events:PutRule",
              + "events:PutTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule",
            ]
        }
    }

  # data.template_file.scan_queue will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scan_queue"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            {
                "StartAt": "Get Lock",
                "States": {
                  "Get Lock": {
                    "Type": "Parallel",
                    "Branches": [
                      {
                        "StartAt": "Acquire Lock",
                        "States": {
                          "Acquire Lock": {
                            "Type": "Task",
                            "Resource": "arn:aws:states:::dynamodb:updateItem",
                            "Parameters": {
                              "TableName": "${table_semaphore}",
                              "Key": {
                                "LockName": {
                                  "S": "${lock_name}"
                                }
                              },
                              "ExpressionAttributeNames":  {
                                "#currentlockcount": "currentlockcount",
                                "#lockownerid.$": "$$.Execution.Id"
                              },
                              "ExpressionAttributeValues": {
                                ":increase": {
                                  "N": "1"
                                },
                                ":limit": {
                                  "N": "${concurrent_scan_limit}"
                                },
                                ":lockacquiredtime": {
                                  "S.$": "$$.State.EnteredTime"
                                }
                              },
                              "UpdateExpression": "SET #currentlockcount = #currentlockcount + :increase, #lockownerid = :lockacquiredtime",
                              "ConditionExpression": "currentlockcount <> :limit and attribute_not_exists(#lockownerid)",
                              "ReturnValues": "UPDATED_NEW"
                            },
                            "Retry": [ 
                                {
                                  "ErrorEquals": ["DynamoDB.AmazonDynamoDBException"],
                                  "MaxAttempts": 0
                                },
                                {
                                  "ErrorEquals": [ "States.ALL" ],
                                  "MaxAttempts": 6,
                                  "BackoffRate": 2
                                } 
                              ], 
                            "Catch": [
                              {
                                "ErrorEquals": ["DynamoDB.AmazonDynamoDBException"],
                                "Next": "Initialize Lock Item",
                                "ResultPath": "$.lockinfo.acquisitionerror"
                              },
                              {
                                "ErrorEquals": [
                                  "DynamoDB.ConditionalCheckFailedException"
                                ],
                                "Next": "Get Current Lock Record",
                                "ResultPath": "$.lockinfo.acquisitionerror"
                              }
                            ],
                            "End": true
                          },
                          "Initialize Lock Item": {
                            "Type": "Task",
                            "Resource": "arn:aws:states:::dynamodb:putItem",
                            "Parameters": {
                              "TableName": "${table_semaphore}",
                              "Item": {
                                "LockName": {
                                  "S": "${lock_name}"
                                },
                                "currentlockcount": {
                                    "N": "0"
                                }
                              },
                              "ConditionExpression": "LockName <> :lockname",
                              "ExpressionAttributeValues": {
                                  ":lockname": {"S": "${lock_name}"}
                              }
                            },
                            "Catch": [
                              {
                                "ErrorEquals": [ "States.ALL" ],
                                "Next": "Acquire Lock",
                                "ResultPath": null
                              }
                            ],
                            "Next": "Acquire Lock",
                            "ResultPath": null
                          },
                          "Get Current Lock Record": {
                            "Type": "Task",
                            "Resource": "arn:aws:states:::dynamodb:getItem",
                            "Parameters": {
                              "TableName": "${table_semaphore}",
                              "ExpressionAttributeNames":  {
                                "#lockownerid.$": "$$.Execution.Id"
                              },
                              "Key": {
                                "LockName": {
                                  "S": "${lock_name}"
                                }
                              },
                              "ProjectionExpression": "#lockownerid"
                            },
                            "ResultSelector": {
                              "Item.$": "$.Item",
                              "ItemString.$": "States.JsonToString($.Item)"
                            },
                            "ResultPath": "$.lockinfo.currentlockitem",
                            "Next": "Check If Lock Already Acquired"
                          },
                          "Check If Lock Already Acquired": {
                            "Type": "Choice",
                            "Choices": [
                              {
                                "And": [
                                  {
                                    "Variable": "$.lockinfo.currentlockitem.ItemString",
                                    "IsPresent": true
                                  },
                                  {
                                    "Variable": "$.lockinfo.currentlockitem.ItemString",
                                    "StringMatches": "*Z*"
                                  }
                                 ],
                                 "Next": "Continue Because Lock Was Already Acquired"
                              }
                            ],
                            "Default": "Wait to Get Lock"
                          },
                          "Continue Because Lock Was Already Acquired": {
                            "Type": "Pass",
                            "End": true
                          },
                          "Wait to Get Lock": {
                            "Type": "Wait",
                            "Seconds": ${retry_interval_seconds},
                            "Next": "Acquire Lock"
                          }
                        }
                      }
                    ],
                    "ResultPath": null,
                    "Next": "Submit to AssemblyLine"
                  },     
                  "Submit to AssemblyLine": {
                    "Type": "Parallel",
                    "Branches": [
                      {
                        "StartAt": "Start AssemblyLine scan",
                        "States": {
                          "Start AssemblyLine scan": {
                            "Type": "Task",
                            "Resource": "arn:aws:states:::lambda:invoke",
                            "Parameters": {
                              "FunctionName": "${worker_lambda}",
                              "Payload": {
                                "task": "assemblyline_scan",
                                "Input.$": "$",
                                "execution_id.$": "$$.Execution.Id"
                              }
                            },
                            "ResultSelector": {
                              "payload.$": "$.Payload"
                            },
                            "End": true
                          }
                        }
                      }
                    ],
                    "Next": "Get AssemblyLine Result"
                  },
                  "Get AssemblyLine Result": {
                    "Type": "Parallel",
                    "Branches": [
                      {
                        "StartAt": "Get Assemblyline Result",
                        "States": {
                          "Get Assemblyline Result": {
                            "Type": "Task",
                            "Resource": "arn:aws:states:::lambda:invoke",
                            "Parameters": {
                              "FunctionName": "${worker_lambda}",
                              "Payload": {
                                "task": "assemblyline_result",
                                "Input.$": "$.[0].payload",
                                "execution_id.$": "$$.Execution.Id"
                              }
                            },
                            "ResultSelector": {
                              "payload.$": "$.Payload"
                            },
                            "End": true
                          }
                        }
                      }
                    ],
                    "Next": "Check If Results Available"
                  },
                  "Check If Results Available": {
                    "Type": "Choice",
                    "InputPath": "$.[0]",
                    "Choices": [
                      {
                        "Variable": "$.payload",
                        "BooleanEquals": true,
                        "Next": "Release Lock"
                      }
                    ],
                    "Default": "Wait to Get Results"
                  },
                  "Wait to Get Results": {
                    "Type": "Wait",
                    "Seconds": ${retry_interval_seconds},
                    "Next": "Get AssemblyLine Result"
                  },
                  "Release Lock": {
                    "Type": "Task",
                    "Resource": "arn:aws:states:::dynamodb:updateItem",
                    "Parameters": {
                      "TableName": "${table_semaphore}",
                      "Key": {
                        "LockName": {
                          "S": "${lock_name}"
                        }
                      },
                      "ExpressionAttributeNames":  {
                        "#currentlockcount": "currentlockcount",
                        "#lockownerid.$": "$$.Execution.Id"
                      },
                      "ExpressionAttributeValues": {
                        ":decrease": {
                          "N": "1"
                        }
                      },
                      "UpdateExpression": "SET #currentlockcount = #currentlockcount - :decrease REMOVE #lockownerid",
                      "ConditionExpression": "attribute_exists(#lockownerid)",
                      "ReturnValues": "UPDATED_NEW"
                    },
                    "Retry": [ 
                      {
                        "ErrorEquals": [ "DynamoDB.ConditionalCheckFailedException" ],
                        "MaxAttempts": 0
                      },
                      {
                        "ErrorEquals": [ "States.ALL" ],
                        "MaxAttempts": 5,
                        "BackoffRate": 1.5
                      } ], 
                    "Catch": [
                      {
                        "ErrorEquals": [
                          "DynamoDB.ConditionalCheckFailedException"
                        ],
                        "Next": "Success State",
                        "ResultPath": null
                      }
                    ],
                    "ResultPath": null,
                    "Next": "Success State"
                  },
                  "Success State": {
                    "Type": "Succeed"
                  }
                }
              }
        EOT
      + vars     = {
          + "concurrent_scan_limit"  = "10"
          + "lock_name"              = "ScanSemaphore"
          + "retry_interval_seconds" = "60"
          + "table_semaphore"        = "scan-locktable"
          + "worker_lambda"          = "api"
        }
    }

  # data.template_file.scan_queue_lock_cleanup will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scan_queue_lock_cleanup"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + Comment = "A state machine that will react to completion events and clean up orphaned locks"
              + StartAt = "Get Current Lock Item"
              + States  = {
                  + Check If Lock Is Held = {
                      + Choices = [
                          + {
                              + And  = [
                                  + {
                                      + IsPresent = true
                                      + Variable  = "$.lockinfo.currentlockitem.ItemString"
                                    },
                                  + {
                                      + StringMatches = "*Z*"
                                      + Variable      = "$.lockinfo.currentlockitem.ItemString"
                                    },
                                ]
                              + Next = "Clean Up Lock"
                            },
                        ]
                      + Comment = "This state checks to see if the execution in question holds a lock. It can tell that by looking for Z, which will be indicative of the timestamp value. That will only be there in the stringified version of the data returned from DDB if this execution holds a lock"
                      + Default = "Success State"
                      + Type    = "Choice"
                    }
                  + Clean Up Lock         = {
                      + Catch      = [
                          + {
                              + ErrorEquals = [
                                  + "DynamoDB.ConditionalCheckFailedException",
                                ]
                              + Next        = "Success State"
                              + ResultPath  = null
                            },
                        ]
                      + Comment    = "If this lockownerid is still there, then clean it up and release the lock"
                      + Next       = "Success State"
                      + Parameters = {
                          + ConditionExpression       = "attribute_exists(#lockownerid)"
                          + ExpressionAttributeNames  = {
                              + #currentlockcount = "currentlockcount"
                              + #lockownerid.$    = "$.detail.executionArn"
                            }
                          + ExpressionAttributeValues = {
                              + :decrease = {
                                  + N = "1"
                                }
                            }
                          + Key                       = {
                              + LockName = {
                                  + S = "${lock_name}"
                                }
                            }
                          + ReturnValues              = "UPDATED_NEW"
                          + TableName                 = "${table_semaphore}"
                          + UpdateExpression          = "SET #currentlockcount = #currentlockcount - :decrease REMOVE #lockownerid"
                        }
                      + Resource   = "arn:aws:states:::dynamodb:updateItem"
                      + ResultPath = null
                      + Retry      = [
                          + {
                              + ErrorEquals = [
                                  + "DynamoDB.ConditionalCheckFailedException",
                                ]
                              + MaxAttempts = 0
                            },
                          + {
                              + BackoffRate     = 1.4
                              + ErrorEquals     = [
                                  + "States.ALL",
                                ]
                              + IntervalSeconds = 5
                              + MaxAttempts     = 20
                            },
                        ]
                      + Type       = "Task"
                    }
                  + Get Current Lock Item = {
                      + Comment        = "Get info from DDB for the lock item to look and see if this specific owner is still holding a lock"
                      + Next           = "Check If Lock Is Held"
                      + Parameters     = {
                          + ExpressionAttributeNames = {
                              + #lockownerid.$ = "$.detail.executionArn"
                            }
                          + Key                      = {
                              + LockName = {
                                  + S = "${lock_name}"
                                }
                            }
                          + ProjectionExpression     = "#lockownerid"
                          + TableName                = "${table_semaphore}"
                        }
                      + Resource       = "arn:aws:states:::dynamodb:getItem"
                      + ResultPath     = "$.lockinfo.currentlockitem"
                      + ResultSelector = {
                          + Item.$       = "$.Item"
                          + ItemString.$ = "States.JsonToString($.Item)"
                        }
                      + Retry          = [
                          + {
                              + BackoffRate     = 1.4
                              + ErrorEquals     = [
                                  + "States.ALL",
                                ]
                              + IntervalSeconds = 5
                              + MaxAttempts     = 20
                            },
                        ]
                      + Type           = "Task"
                    }
                  + Success State         = {
                      + Type = "Succeed"
                    }
                }
            }
        )
      + vars     = {
          + "lock_name"       = "ScanSemaphore"
          + "table_semaphore" = "scan-locktable"
        }
    }

  # aws_dynamodb_table.completed-scans will be created
  + resource "aws_dynamodb_table" "completed-scans" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "EXECUTION_ID"
      + id               = (known after apply)
      + name             = "completed-scans"
      + read_capacity    = 0
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + write_capacity   = 0

      + attribute {
          + name = "EXECUTION_ID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.scan-locktable will be created
  + resource "aws_dynamodb_table" "scan-locktable" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockName"
      + id               = (known after apply)
      + name             = "scan-locktable"
      + read_capacity    = 0
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + write_capacity   = 0

      + attribute {
          + name = "LockName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_policy.scan_queue will be created
  + resource "aws_iam_policy" "scan_queue" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "scan-files-scan_queue"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.scan_queue will be created
  + resource "aws_iam_role" "scan_queue" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "states.ca-central-1.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-files-scan_queue"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.scan_runner will be created
  + resource "aws_iam_role_policy_attachment" "scan_runner" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-scan_queue"
    }

  # aws_sfn_state_machine.scan_queue will be created
  + resource "aws_sfn_state_machine" "scan_queue" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "assemblyline-file-scan-queue"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

  # aws_sfn_state_machine.scan_queue_lock_cleanup will be created
  + resource "aws_sfn_state_machine" "scan_queue_lock_cleanup" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "assemblyline-file-scan-queue-lock-cleanup"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
